/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_radtodeg.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mmonahan <mmonahan@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/12 15:21:39 by mmonahan          #+#    #+#             */
/*   Updated: 2020/11/12 04:23:40 by mmonahan         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
**	Возвращает 0 если строка str длиной len является пустой.
*/

int	ft_check_empty_srt(char *str, size_t len)
{
	size_t	i;

	i = 0;
	while (i < len)
		if (str[i++])
			return (1);
	return (0);
}
